src/openpersonen/api/request_templates/RequestOuder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:gml="http://www.opengis.net/gml">
   <soapenv:Header>
        <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <Timestamp>
                <Created>{{ created }}</Created>
                <Expires>{{ expired }}</Expires>
            </Timestamp>
            <UsernameToken>
                <Username>{{ username }}</Username>
                <Password>{{ password }}</Password>
            </UsernameToken>
        </Security>
    </soapenv:Header>
   <soapenv:Body>
      <ns:npsLv01>
         <ns:stuurgegevens>
            <StUF:berichtcode>?</StUF:berichtcode>
            <!--Optional:-->
            <StUF:zender>
               <!--Optional:-->
               <StUF:organisatie>{{ zender_organisatie }}</StUF:organisatie>
               <StUF:applicatie>{{ zender_applicatie }}</StUF:applicatie>
               <!--Optional:-->
               <StUF:administratie>{{ zender_administratie }}</StUF:administratie>
               <!--Optional:-->
               <StUF:gebruiker>{{ zender_gebruiker }}</StUF:gebruiker>
            </StUF:zender>
            <!--Optional:-->
            <StUF:ontvanger>
               <!--Optional:-->
               <StUF:organisatie>{{ ontvanger_organisatie }}</StUF:organisatie>
               <StUF:applicatie>{{ ontvanger_applicatie }}</StUF:applicatie>
               <!--Optional:-->
               <StUF:administratie>{{ ontvanger_administratie }}</StUF:administratie>
               <!--Optional:-->
               <StUF:gebruiker>{{ ontvanger_gebruiker }}</StUF:gebruiker>
            </StUF:ontvanger>
            <!--Optional:-->
            <StUF:referentienummer>{{ referentienummer }}</StUF:referentienummer>
            <!--Optional:-->
            <StUF:tijdstipBericht>{{ tijdstip_bericht }}</StUF:tijdstipBericht>
            <StUF:entiteittype>?</StUF:entiteittype>
         </ns:stuurgegevens>
         <ns:parameters>
            <StUF:sortering>?</StUF:sortering>
            <StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
            <!--Optional:-->
            <StUF:maximumAantal>15</StUF:maximumAantal>
            <!--Optional:-->
            <StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
            <!--Optional:-->
            <StUF:indicatorAantal>false</StUF:indicatorAantal>
         </ns:parameters>
         <!--Optional:-->
         <ns:gelijk StUF:entiteittype="NPS">
            <ns:inp.bsn StUF:noValue="?" StUF:exact="true">{{ bsn }}</ns:inp.bsn>
         </ns:gelijk>
         <!--Optional:-->
         <ns:scope>
            <ns:object StUF:entiteittype="NPS">
                <!--Optional:-->
                <ns:inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD">
                  <ns:gerelateerde StUF:entiteittype="NPS">
                     <!--You have a CHOICE of the next 2 items at this level-->
                     <!--Optional:-->
                     <ns:inp.bsn/>
                     <!--Optional:-->
                     <ns:geslachtsaanduiding/>
                     <!--Optional:-->
                     <ns:ouderAanduiding/>
                     <!--Optional:-->
                     <ns:datumIngangFamilierechtelijkeBetrekking/>
                     <!--Optional:-->
                     <ns:geslachtsnaam />
                     <!--Optional:-->
                     <ns:voorletters />
                     <!--Optional:-->
                     <ns:voornamen />
                     <!--Optional:-->
                     <ns:voorvoegselGeslachtsnaam />
                     <!--Optional:-->
                     <ns:geboortedatum />
                     <!--Optional:-->
                     <ns:inp.geboorteplaats />
                     <!--Optional:-->
                     <ns:inp.geboorteLand />
                  </ns:gerelateerde>
               </ns:inp.heeftAlsOuders>
            </ns:object>
         </ns:scope>
      </ns:npsLv01>
   </soapenv:Body>
</soapenv:Envelope>
